OdRxValue.serializeIn(System.Void!System.Runtime.CompilerServices.IsConst*,System.UInt64)
\details
Read value from the byte array.
\param pBytes        [out] Pointer to the byte array.
\param maxBytesToRead [in] Maximum number of bytes to read.
\returns
Actual number of bytes read.

OdRxValue.serializeOut(System.Void*,System.UInt64*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Store value in the byte array.
\param pBytes         [out] Pointer to the byte array.
\param maxBytesToWrite [in] Maximum number of bytes to write.
\returns
Actual number of bytes written.

OdRxValue.getEnumTag
\details
Get the corresponding descriptor, if this value contains an enumeration
item.
\returns
Enumeration item descriptor.

OdRxValue.op_Inequality(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Negative comparison operator.
\param value [in] Value to compare with the current value.
\returns
True if values are not equal; false otherwise.

OdRxValue.op_Equality(OdRxValue!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Comparison operator.
\param value [in] Value to compare with the current value.
\returns
True if values are equal; false otherwise.

OdRxValue.toString(OdRxValueType.StringFormat)
\details
Convert value to string.
\param format [in] Defines the format of the resulting string.
\returns
Converted value.
\remarks
Mostly for debug purposes.

OdRxValue.isVaries
\details
Returns true if the value is undefined. This is represented by assigning
special singleton value "varies".
\returns
True if the value is undefined; false otherwise.

OdRxValue.isEmpty
\details
Checks if the value is empty.
\returns
True if the value is empty; false otherwise.

OdRxValue.type
\details
Get metaclass describing C++ type of the stored value.
\returns
Metaclass describing C++ type of the stored value.

OdRxValue.Dispose
\details
Default destructor for objects of the OdRxValue class.

OdRxValue.#ctor
\details
Default constructor for objects of the OdRxValue class.